import java.util.List;


public class Main {
    public static void main(String[] args) {
        String rawText = """
                Теорія великого вибуху — це американський комедійний серіал, 
                який вийшов в ефір у 2007 році і тривав до 2019 року. 
                Серіал розповідає про році групу друзів, 
                які є вченими і живуть в Лос-Анджелес 2007 році, великого вибуху.
                Шелдон Купер — це геніальний, але соціально незграбний вийшов фізик.
                Леонард Хоутен — експериментальний фізик, в який великого намагається завести стосунки.
                Говард Воловіц — інженер, який любить ефір жартувати.
                Райан у Нозер — астрофізик і хороший друг.
                """;

        // Створюємо об'єкт тексту
        Text text = new Text(rawText);

        // Знаходимо унікальні слова
        List<Word> uniqueWords = TextProcessor.findUniqueWords(text);

        // Виводимо результат
        System.out.print("Унікальні слова: ");
        for (Word word : uniqueWords) {
            System.out.print(word.getWord() + " ");
        }
    }
}
