public class Main {
    public static void main(String[] args) {

        String text = """
                Теорія великого вибуху — це американський комедійний серіал, 
                який вийшов в ефір у 2007 році і тривав до 2019 року. 
                Серіал розповідає про році групу друзів, 
                які є вченими і живуть в Лос-Анджелес 2007 році,великого вибуху.
                Шелдон Купер — це геніальний, але соціально незграбний вийшов фізик.
                Леонард Хоутен — експериментальний фізик, в який великого намагається завести стосунки.
                Говард Воловіц — інженер, який любить ефір жартувати.
                Райан у Нозер — астрофізик і хороший друг.
                """;

        String[] uniqueWords = UniqueWordFinder.findUniqueWords(text);

        System.out.print("Унікальні слова: ");
        for (String word : uniqueWords) {
            System.out.print(word + " ");
        }
    }
}
